In [1]:
import pandas as pd

#### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
df=pd.Series([4,8,15,16,23,42])

In [3]:
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [4]:
type(df)

pandas.core.series.Series

#### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [5]:
ls=[12,34,36,78,"fs","reee","@",4.5,33]

In [6]:
df1=pd.Series(ls)

In [7]:
df1

0      12
1      34
2      36
3      78
4      fs
5    reee
6       @
7     4.5
8      33
dtype: object

#### Q3. Create a Pandas DataFrame that contains the following data:

In [8]:
df2=pd.DataFrame({'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']})

In [9]:
df2

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

#### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In pandas, a 'DataFrame' is a two-dimensional labeled data structure that consists of columns, each of which can hold different data types (e.g., integers, floats, strings), and rows, which represent observations or records. 

On the other hand, a Series is a one-dimensional labeled array that can hold any data type

In [11]:
#Example
#Create a Dataframe
data = {'Name': ['John', 'Emma', 'Mike', 'Emily'],
        'Age': [25, 30, 28, 22],
        'Height': [175, 165, 180, 160]}
data_f = pd.DataFrame(data)
data_f

    Name  Age  Height
0   John   25     175
1   Emma   30     165
2   Mike   28     180
3  Emily   22     160

In [ ]:
# Create a Series
ages = pd.Series([25, 30, 28, 22], name='Age')

In [13]:
ages

0    25
1    30
2    28
3    22
Name: Age, dtype: int64

#### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

1.head()- To get data from starting rather than full dataframe.

In [15]:
#Example
df2.head(2)

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

2.tail()-to get data from the last rows.

In [16]:
#Example
df2.tail(2)

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female

3.dtype()- To get data type of each column.

In [21]:
#xample
data_f.dtypes

Name      object
Age        int64
Height     int64
dtype: object

#### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

A mutable object can be modified after it is created, allowing changes to its values or structure. In the case of Series and DataFrame, we can modify the values within them, add or remove rows or columns, and perform various operations that alter the data or structure.

#### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [23]:
s1=pd.Series(['Utkarsh','Reesha','vishal'])
s2=pd.Series([21,21,20])
s3=pd.Series(['CS','Arts','Civil'])
ddf_new=pd.DataFrame({'Name':s1,'Age':s2,'Field':s3})

In [24]:
ddf_new

      Name  Age  Field
0  Utkarsh   21     CS
1   Reesha   21   Arts
2   vishal   20  Civil